package cn.t.util.media.video.mp4.modal.level1;

import cn.t.util.media.video.mp4.enums.BoxType;
import cn.t.util.media.video.mp4.modal.Box;

/********************************************************************************************
 **        字段名称             |    长度(bytes)    |        有关描述
 --------------------------------------------------------------------------------------------
 **        boxsize             |    4             |        box的长度
 **        boxtype             |    4             |        box的类型
 **                                               |        后面全是真实数据
 *  ********************************************************************************************
 *
 * BoxSize         :92496171
 * BoxType         :mdat
 * 00 A0 B0 C0 D0 E0 F0 10 20 30 40 50 60 70 80 90 00
 * 00 A0 B0 C0 D0 E0 F0 10 20 30 40 50 60 70 80 90 00
 * 00 A0 B0 C0 D0 E0 F0 10 20 30 40 50 60 70 80 90 00
 * 00 A0 B0 C0 D0 E0 F0 10 20 30 40 50 60 70 80 90 00
 *
 ********************************************************************************************/
public class MdatBox extends Box {

    public MdatBox() {
        type = BoxType.MDAT.value;
    }
}
